In [23]:
import pandas as pd

In [24]:
base = pd.read_csv('credit_data.csv')

In [25]:
base

      i#clientid        income        age         loan  c#default
0              1  66155.925095  59.017015  8106.532131          0
1              2  34415.153966  48.117153  6564.745018          0
2              3  57317.170063  63.108049  8020.953296          0
3              4  42709.534201  45.751972  6103.642260          0
4              5  66952.688845  18.584336  8770.099235          1
...          ...           ...        ...          ...        ...
1995        1996  59221.044874  48.518179  1926.729397          0
1996        1997  69516.127573  23.162104  3503.176156          0
1997        1998  44311.449262  28.017167  5522.786693          1
1998        1999  43756.056605  63.971796  1622.722598          0
1999        2000  69436.579552  56.152617  7378.833599          0

[2000 rows x 5 columns]

In [26]:
base.head()

   i#clientid        income        age         loan  c#default
0           1  66155.925095  59.017015  8106.532131          0
1           2  34415.153966  48.117153  6564.745018          0
2           3  57317.170063  63.108049  8020.953296          0
3           4  42709.534201  45.751972  6103.642260          0
4           5  66952.688845  18.584336  8770.099235          1

In [27]:
base.rename(columns={'age':'idade', 'i#clientid':'id'}, inplace=True)

In [28]:
base.head()

   id        income      idade         loan  c#default
0   1  66155.925095  59.017015  8106.532131          0
1   2  34415.153966  48.117153  6564.745018          0
2   3  57317.170063  63.108049  8020.953296          0
3   4  42709.534201  45.751972  6103.642260          0
4   5  66952.688845  18.584336  8770.099235          1